# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [6]:
#Your code here
cur.execute('''SELECT firstname, lastname FROM employees JOIN offices USING(officecode) WHERE city = 'Boston';''').fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [11]:
#Your code here
cur.execute('''SELECT city, count(*) FROM offices LEFT JOIN employees USING(officecode) group by 1;''')
df = pd.DataFrame(cur.fetchall())
df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

In [ ]:
#No, all offices have employees

## Write 3 Questions of your own and answer them

In [23]:
#Are any orders ready to be shipped?
cur.execute('''select status, count(*) FROM orders join orderdetails using(ordernumber) group by 1;''')
df = pd.DataFrame(cur.fetchall())
df.head(10)

            0     1
0   Cancelled    79
1    Disputed    14
2  In Process    41
3     On Hold    44
4    Resolved    47
5     Shipped  2771

In [ ]:
#Most are shipped, 41 in process, 44 on hold

In [24]:
# What is the highest quantity of product ordered?
cur.execute('''SELECT productname, quantityordered from orderdetails left join products using(productcode) order by quantityordered desc;''')
df = pd.DataFrame(cur.fetchall())
df.head(10)

                                0   1
0              1969 Dodge Charger  97
1            1969 Dodge Super Bee  90
2  America West Airlines B757-200  85
3              F/A 18 Hornet 1/72  77
4         1970 Plymouth Hemi Cuda  77
5         1956 Porsche 356A Coupe  76
6        1917 Grand Touring Sedan  76
7              1949 Jaguar XK 120  76
8        1962 Volkswagen Microbus  70
9         1956 Porsche 356A Coupe  70

In [ ]:
#Highest quantity of product ordered is the 1969 dodge charger

In [25]:
#What is the name of the customer that made the highest payment?
cur.execute('''SELECT customername, amount from customers left join payments using(customernumber) order by amount desc;''')
df = pd.DataFrame(cur.fetchall())
df.head(10)

                              0         1
0              FunGiftIdeas.com   9977.85
1   Australian Gift Network, Co   9821.32
2       Auto-Moto Classics Inc.   9658.74
3  Australian Collectables, Ltd   9415.13
4               Mini Auto Werke   8807.12
5      Corporate Gift Ideas Co.  85559.12
6  Mini Gifts Distributors Ltd.  85410.87
7                  Herkku Gifts  85024.46
8  Mini Gifts Distributors Ltd.  83598.04
9           Mini Creations Ltd.   8307.28

In [ ]:
#Fungiftideas.com had highest payment amount

## Level Up: Display the names of each product each employee has sold.

In [26]:
# Your code here
cur.execute('''SELECT firstname, lastname, productname 
from employees 
join customers 
on employees.employeenumber = customers.salesrepemployeenumber 
join orders using(customernumber)
join orderdetails using(ordernumber)
join products using(productcode);''')
df = pd.DataFrame(cur.fetchall())
df.head(10)

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang
5  Leslie  Jennings                           1968 Dodge Charger
6  Leslie  Jennings                      1970 Plymouth Hemi Cuda
7  Leslie  Jennings                           1969 Dodge Charger
8  Leslie  Jennings                  1948 Porsche 356-A Roadster
9  Leslie  Jennings                         1969 Dodge Super Bee

## Level Up: Display the Number of Products each Employee Has sold

In [30]:
#Your code here
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!